luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxSent_regdef.h
/** \brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_SENT_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_SENT_KRSTCLR_Bits;

/** \brief  OCDS Control and Status */
typedef struct _Ifx_SENT_OCS_Bits
{
    unsigned int reserved_0:24;             /**< \brief \internal Reserved */
    unsigned int SUS:4;                     /**< \brief [27:24] OCDS Suspend Control (rw) */
    unsigned int SUS_P:1;                   /**< \brief [28:28] SUS Write Protection (w) */
    unsigned int SUSSTA:1;                  /**< \brief [29:29] Suspend State (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_SENT_OCS_Bits;

/** \brief  Receive Data Register */
typedef struct _Ifx_SENT_RDR_Bits
{
    unsigned int RD0:4;                     /**< \brief [3:0] Receive Data Nibble 0 (rh) */
    unsigned int RD1:4;                     /**< \brief [7:4] Receive Data Nibble 1 (rh) */
    unsigned int RD2:4;                     /**< \brief [11:8] Receive Data Nibble 2 (rh) */
    unsigned int RD3:4;                     /**< \brief [15:12] Receive Data Nibble 3 (rh) */
    unsigned int RD4:4;                     /**< \brief [19:16] Receive Data Nibble 4 (rh) */
    unsigned int RD5:4;                     /**< \brief [23:20] Receive Data Nibble 5 (rh) */
    unsigned int RD6:4;                     /**< \brief [27:24] Receive Data Nibble 6 (rh) */
    unsigned int RD7:4;                     /**< \brief [31:28] Receive Data Nibble 7 (rh) */
} Ifx_SENT_RDR_Bits;

/** \brief  Receive Time Stamp Register */
typedef struct _Ifx_SENT_RTS_Bits
{
    unsigned int LTS:32;                    /**< \brief [31:0] Last Receive Time Stamp for Channel x (r) */
} Ifx_SENT_RTS_Bits;

/** \brief  Time Stamp Predivider Register */
typedef struct _Ifx_SENT_TPD_Bits
{
    unsigned int TDIV:20;                   /**< \brief [19:0] Divider Factor of Pre Divider for TSR (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_SENT_TPD_Bits;

/** \brief  Time Stamp Register */
typedef struct _Ifx_SENT_TSR_Bits
{
    unsigned int CTS:32;                    /**< \brief [31:0] Current Time Stamp for the Module (r) */
} Ifx_SENT_TSR_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Sent_union
 * \{  */

/** \brief  Access Enable Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_ACCEN0_Bits B;                 /**< \brief Bitfield access */
} Ifx_SENT_ACCEN0;

/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_ACCEN1_Bits B;                 /**< \brief Bitfield access */
} Ifx_SENT_ACCEN1;

/** \brief  Channel Fractional Divider Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_CH_CFDR_Bits B;                /**< \brief Bitfield access */
} Ifx_SENT_CH_CFDR;

/** \brief  Channel Pre Divider Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_CH_CPDR_Bits B;                /**< \brief Bitfield access */
} Ifx_SENT_CH_CPDR;

/** \brief  Interrupt Node Pointer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_CH_INP_Bits B;                 /**< \brief Bitfield access */
} Ifx_SENT_CH_INP;

/** \brief  Interrupt Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_CH_INTCLR_Bits B;              /**< \brief Bitfield access */
} Ifx_SENT_CH_INTCLR;

/** \brief  Interrupt Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_CH_INTEN_Bits B;               /**< \brief Bitfield access */
} Ifx_SENT_CH_INTEN;

/** \brief  Interrupt Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_CH_INTSET_Bits B;              /**< \brief Bitfield access */
} Ifx_SENT_CH_INTSET;

/** \brief  Interrupt Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_CH_INTSTAT_Bits B;             /**< \brief Bitfield access */
} Ifx_SENT_CH_INTSTAT;

/** \brief  Input and Output Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_CH_IOCR_Bits B;                /**< \brief Bitfield access */
} Ifx_SENT_CH_IOCR;

/** \brief  Receiver Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_CH_RCR_Bits B;                 /**< \brief Bitfield access */
} Ifx_SENT_CH_RCR;

/** \brief  Receive Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_CH_RSR_Bits B;                 /**< \brief Bitfield access */
} Ifx_SENT_CH_RSR;

/** \brief  SPC Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_CH_SCR_Bits B;                 /**< \brief Bitfield access */
} Ifx_SENT_CH_SCR;

